

# короче это костяк системного промта в файле ya_gpt будет составляться системный промт и там же вставляться в запрос
SYSTEM_PROMPT = 'Кратко назови 5 лучших книг '


# короче это костяк системного промпта в файле ya_gpt будет составляться системный промт и там же вставляться в запрос
SYSTEM_PROMPT_1 = 'Ты описываешь год написания и краткое содержание книги, не раскрывая её концовки.'

DATABASE_NAME = 'messages.db'

TABLE_NAME = 'users'

NAME_FILE_LOGS = 'logs.txt'

GOOD_STATUS_CODE = 200

TEXT_APOLOGIES = 'Прошу прощения, но мы столкнулись с превышением лимитов. Приносим извинения, надеемся на понимание.'

MAX_USERS = 10

GENRE_LIST = ['любой', 'роман', "повесть", "рассказ", "новелла", "сказка", "драма", "комедия", "трагедия", "поэма"]

MAX_USER_GPT_TOKENS = 1000
