GREETING = (
    'Приветствую, любезный пользователь! Я бот-книжный помощник для любителей почитать.\n'
    ' Тыкай /help , если что-то непонятно.'
)

TEXT_HELP = '1'  # TODO: написать эту штуку, потому что у меня с этим проблемы

# короче это костяк системного промта я файле ya_gpt будет составляться системный промт и там же вставляться в запрос
SYSTEM_PROMPT = 'Ты консультант по подбору книг. Укажи десять лучших книг, "автор - год издания - название"'

DATABASE_NAME = 'messages.db'

TABLE_NAME = 'users'

NAME_FILE_LOGS = 'logs.txt'

GOOD_STATUS_KOD = 200
